finance/QuantitativeInvestment.org
#+SETUPFILE: ../configOrg/level1.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t
#+OPTIONS: title:t toc:t todo:t |:t
#+TITLES: QuantitativeInvestment
#+DATE: <2017-05-26 Fri>
#+AUTHORS weiwu
#+EMAIL: victor.wuv@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.4)



* Event study
[[file:./EventStudy.org][EventStudy]]
The Event Study module is designed to evaluate the impact of discrete events on future returns. Classic examples of these events are stock splits, earnings surprises, index additions and deletions. The event study attempts to determine if there is a significant abnormal return which can be attributed to the occurrence of the event.

** Event study workflow
** Event study report
* Factor backtest
* Forecast model
* Simple forecast model
* Transaction cost model
* Risk model
* Strategy simulation
* Simulation workflow
* Trade simulator interface
* Report template editor
* Script editor and debugger
* ModelScript reference
* Included Scripts
* Included Cpp Scripts
* Using Microsoft Visual Studio
* Portfolio optimization
* ClariFI portfolio optimization
* Barra portfolio optimization
* Northfield portfolio optimization
* Axioma portfolio optimization
* Portfolio attribution
* Portfolio attribution process
* Portfolio attribution export
* Portfolio attribution report
* Top down snapshot
* Top down history
* Cumulative Brinson attribution
* Brinson attribution history
* Contribution snapshot
* Contribution history
* Risk factor snapshot
* Risk factor history
* Risk attribution snapshot
* Risk factor attribution
* Process launcher
* Cache data
* multi-factor model
[[file:./MultiFactorModel.org][MultiFactorModel]]

[[file:./IndustryNeutral.org][行业中性]]


* Performance analytics:

** percentage change:
$$percentage change(P_n) = value / value.shift(1)$$
** cumlative return:
$$total_return = (1+P_1)*(1+P_2)*...(1+P_n) - 1.0$$
** annualized return:
$$annualized return = (1 + cumulative return)^(252/periods) - 1.0$$
$$(annualized return + 1)^(periods/252) = 1 + cumulative return$$
** annualized volatility:
$\sigma = standard deviation of returns(degree of freedom N -1)$
$$annualized volatility = \sigma * \sqrt(periods)$$
** annualized downrisk volatility:
** downside standard deviation:
Downside deviation is a measure of downside risk that focuses on returns that fall below a minimum threshold or minimum acceptable return (MAR). It is used in the calculation of a risk measure known as the Sortino Ratio.
$$MAR=\sqrt{E[(X-E[X])^2]1{X<E[X]}])^0.5}
** sharpe ratio:
$$sharpe ratio = (E[annual returns] - interest rate)/\sigma_annual$$
** sortino ratio:
$$SR = \div{annual return - R_f, Downside Risk}$$
** return standard deviation:
$\sigma = standard deviation of returns(degree of freedom N -1)$
