docs/finance/QuantitativeInvestment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-29 Fri 20:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. Event study</a>
<ul>
<li><a href="#orgheadline1">1.1. Event study workflow</a></li>
<li><a href="#orgheadline2">1.2. Event study report</a></li>
</ul>
</li>
<li><a href="#orgheadline4">2. Factor backtest</a></li>
<li><a href="#orgheadline5">3. Forecast model</a></li>
<li><a href="#orgheadline6">4. Simple forecast model</a></li>
<li><a href="#orgheadline7">5. Transaction cost model</a></li>
<li><a href="#orgheadline8">6. Risk model</a></li>
<li><a href="#orgheadline9">7. Strategy simulation</a></li>
<li><a href="#orgheadline10">8. Simulation workflow</a></li>
<li><a href="#orgheadline11">9. Trade simulator interface</a></li>
<li><a href="#orgheadline12">10. Report template editor</a></li>
<li><a href="#orgheadline13">11. Script editor and debugger</a></li>
<li><a href="#orgheadline14">12. ModelScript reference</a></li>
<li><a href="#orgheadline15">13. Included Scripts</a></li>
<li><a href="#orgheadline16">14. Included Cpp Scripts</a></li>
<li><a href="#orgheadline17">15. Using Microsoft Visual Studio</a></li>
<li><a href="#orgheadline18">16. Portfolio optimization</a></li>
<li><a href="#orgheadline19">17. ClariFI portfolio optimization</a></li>
<li><a href="#orgheadline20">18. Barra portfolio optimization</a></li>
<li><a href="#orgheadline21">19. Northfield portfolio optimization</a></li>
<li><a href="#orgheadline22">20. Axioma portfolio optimization</a></li>
<li><a href="#orgheadline23">21. Portfolio attribution</a></li>
<li><a href="#orgheadline24">22. Portfolio attribution process</a></li>
<li><a href="#orgheadline25">23. Portfolio attribution export</a></li>
<li><a href="#orgheadline26">24. Portfolio attribution report</a></li>
<li><a href="#orgheadline27">25. Top down snapshot</a></li>
<li><a href="#orgheadline28">26. Top down history</a></li>
<li><a href="#orgheadline29">27. Cumulative Brinson attribution</a></li>
<li><a href="#orgheadline30">28. Brinson attribution history</a></li>
<li><a href="#orgheadline31">29. Contribution snapshot</a></li>
<li><a href="#orgheadline32">30. Contribution history</a></li>
<li><a href="#orgheadline33">31. Risk factor snapshot</a></li>
<li><a href="#orgheadline34">32. Risk factor history</a></li>
<li><a href="#orgheadline35">33. Risk attribution snapshot</a></li>
<li><a href="#orgheadline36">34. Risk factor attribution</a></li>
<li><a href="#orgheadline37">35. Process launcher</a></li>
<li><a href="#orgheadline38">36. Cache data</a></li>
<li><a href="#orgheadline39">37. multi-factor model</a></li>
<li><a href="#orgheadline49">38. Performance analytics:</a>
<ul>
<li><a href="#orgheadline40">38.1. percentage change:</a></li>
<li><a href="#orgheadline41">38.2. cumlative return:</a></li>
<li><a href="#orgheadline42">38.3. annualized return:</a></li>
<li><a href="#orgheadline43">38.4. annualized volatility:</a></li>
<li><a href="#orgheadline44">38.5. annualized downrisk volatility:</a></li>
<li><a href="#orgheadline45">38.6. downside standard deviation:</a></li>
<li><a href="#orgheadline46">38.7. sharpe ratio:</a></li>
<li><a href="#orgheadline47">38.8. sortino ratio:</a></li>
<li><a href="#orgheadline48">38.9. return standard deviation:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
#+AUTHORS weiwu
</p>



<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> Event study</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="./EventStudy.html">EventStudy</a>
The Event Study module is designed to evaluate the impact of discrete events on future returns. Classic examples of these events are stock splits, earnings surprises, index additions and deletions. The event study attempts to determine if there is a significant abnormal return which can be attributed to the occurrence of the event.
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Event study workflow</h3>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Event study report</h3>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">2</span> Factor backtest</h2>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">3</span> Forecast model</h2>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">4</span> Simple forecast model</h2>
</div>
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">5</span> Transaction cost model</h2>
</div>
<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">6</span> Risk model</h2>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">7</span> Strategy simulation</h2>
</div>
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">8</span> Simulation workflow</h2>
</div>
<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">9</span> Trade simulator interface</h2>
</div>
<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">10</span> Report template editor</h2>
</div>
<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">11</span> Script editor and debugger</h2>
</div>
<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">12</span> ModelScript reference</h2>
</div>
<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">13</span> Included Scripts</h2>
</div>
<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">14</span> Included Cpp Scripts</h2>
</div>
<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">15</span> Using Microsoft Visual Studio</h2>
</div>
<div id="outline-container-orgheadline18" class="outline-2">
<h2 id="orgheadline18"><span class="section-number-2">16</span> Portfolio optimization</h2>
</div>
<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">17</span> ClariFI portfolio optimization</h2>
</div>
<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20"><span class="section-number-2">18</span> Barra portfolio optimization</h2>
</div>
<div id="outline-container-orgheadline21" class="outline-2">
<h2 id="orgheadline21"><span class="section-number-2">19</span> Northfield portfolio optimization</h2>
</div>
<div id="outline-container-orgheadline22" class="outline-2">
<h2 id="orgheadline22"><span class="section-number-2">20</span> Axioma portfolio optimization</h2>
</div>
<div id="outline-container-orgheadline23" class="outline-2">
<h2 id="orgheadline23"><span class="section-number-2">21</span> Portfolio attribution</h2>
</div>
<div id="outline-container-orgheadline24" class="outline-2">
<h2 id="orgheadline24"><span class="section-number-2">22</span> Portfolio attribution process</h2>
</div>
<div id="outline-container-orgheadline25" class="outline-2">
<h2 id="orgheadline25"><span class="section-number-2">23</span> Portfolio attribution export</h2>
</div>
<div id="outline-container-orgheadline26" class="outline-2">
<h2 id="orgheadline26"><span class="section-number-2">24</span> Portfolio attribution report</h2>
</div>
<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="section-number-2">25</span> Top down snapshot</h2>
</div>
<div id="outline-container-orgheadline28" class="outline-2">
<h2 id="orgheadline28"><span class="section-number-2">26</span> Top down history</h2>
</div>
<div id="outline-container-orgheadline29" class="outline-2">
<h2 id="orgheadline29"><span class="section-number-2">27</span> Cumulative Brinson attribution</h2>
</div>
<div id="outline-container-orgheadline30" class="outline-2">
<h2 id="orgheadline30"><span class="section-number-2">28</span> Brinson attribution history</h2>
</div>
<div id="outline-container-orgheadline31" class="outline-2">
<h2 id="orgheadline31"><span class="section-number-2">29</span> Contribution snapshot</h2>
</div>
<div id="outline-container-orgheadline32" class="outline-2">
<h2 id="orgheadline32"><span class="section-number-2">30</span> Contribution history</h2>
</div>
<div id="outline-container-orgheadline33" class="outline-2">
<h2 id="orgheadline33"><span class="section-number-2">31</span> Risk factor snapshot</h2>
</div>
<div id="outline-container-orgheadline34" class="outline-2">
<h2 id="orgheadline34"><span class="section-number-2">32</span> Risk factor history</h2>
</div>
<div id="outline-container-orgheadline35" class="outline-2">
<h2 id="orgheadline35"><span class="section-number-2">33</span> Risk attribution snapshot</h2>
</div>
<div id="outline-container-orgheadline36" class="outline-2">
<h2 id="orgheadline36"><span class="section-number-2">34</span> Risk factor attribution</h2>
</div>
<div id="outline-container-orgheadline37" class="outline-2">
<h2 id="orgheadline37"><span class="section-number-2">35</span> Process launcher</h2>
</div>
<div id="outline-container-orgheadline38" class="outline-2">
<h2 id="orgheadline38"><span class="section-number-2">36</span> Cache data</h2>
</div>
<div id="outline-container-orgheadline39" class="outline-2">
<h2 id="orgheadline39"><span class="section-number-2">37</span> multi-factor model</h2>
<div class="outline-text-2" id="text-37">
<p>
<a href="./MultiFactorModel.html">MultiFactorModel</a>
</p>

<p>
<a href="./IndustryNeutral.html">行业中性</a>
</p>
</div>
</div>


<div id="outline-container-orgheadline49" class="outline-2">
<h2 id="orgheadline49"><span class="section-number-2">38</span> Performance analytics:</h2>
<div class="outline-text-2" id="text-38">
</div><div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">38.1</span> percentage change:</h3>
<div class="outline-text-3" id="text-38-1">
<p>
\[percentage change(P_n) = value / value.shift(1)\]
</p>
</div>
</div>
<div id="outline-container-orgheadline41" class="outline-3">
<h3 id="orgheadline41"><span class="section-number-3">38.2</span> cumlative return:</h3>
<div class="outline-text-3" id="text-38-2">
<p>
\[total_return = (1+P_1)*(1+P_2)*...(1+P_n) - 1.0\]
</p>
</div>
</div>
<div id="outline-container-orgheadline42" class="outline-3">
<h3 id="orgheadline42"><span class="section-number-3">38.3</span> annualized return:</h3>
<div class="outline-text-3" id="text-38-3">
<p>
\[annualized return = (1 + cumulative return)^(252/periods) - 1.0\]
\[(annualized return + 1)^(periods/252) = 1 + cumulative return\]
</p>
</div>
</div>
<div id="outline-container-orgheadline43" class="outline-3">
<h3 id="orgheadline43"><span class="section-number-3">38.4</span> annualized volatility:</h3>
<div class="outline-text-3" id="text-38-4">
<p>
\(\sigma = standard deviation of returns(degree of freedom N -1)\)
\[annualized volatility = \sigma * \sqrt(periods)\]
</p>
</div>
</div>
<div id="outline-container-orgheadline44" class="outline-3">
<h3 id="orgheadline44"><span class="section-number-3">38.5</span> annualized downrisk volatility:</h3>
</div>
<div id="outline-container-orgheadline45" class="outline-3">
<h3 id="orgheadline45"><span class="section-number-3">38.6</span> downside standard deviation:</h3>
<div class="outline-text-3" id="text-38-6">
<p>
Downside deviation is a measure of downside risk that focuses on returns that fall below a minimum threshold or minimum acceptable return (MAR). It is used in the calculation of a risk measure known as the Sortino Ratio.
$$MAR=\sqrt{E[(X-E[X])<sup>2</sup>]1{X&lt;E[X]}])<sup>0.5</sup>}
</p>
</div>
</div>
<div id="outline-container-orgheadline46" class="outline-3">
<h3 id="orgheadline46"><span class="section-number-3">38.7</span> sharpe ratio:</h3>
<div class="outline-text-3" id="text-38-7">
<p>
\[sharpe ratio = (E[annual returns] - interest rate)/\sigma_annual\]
</p>
</div>
</div>
<div id="outline-container-orgheadline47" class="outline-3">
<h3 id="orgheadline47"><span class="section-number-3">38.8</span> sortino ratio:</h3>
<div class="outline-text-3" id="text-38-8">
<p>
\[SR = \div{annual return - R_f, Downside Risk}\]
</p>
</div>
</div>
<div id="outline-container-orgheadline48" class="outline-3">
<h3 id="orgheadline48"><span class="section-number-3">38.9</span> return standard deviation:</h3>
<div class="outline-text-3" id="text-38-9">
<p>
\(\sigma = standard deviation of returns(degree of freedom N -1)\)
</p>
</div>
</div>
</div>
</div>
</body>
</html>
